 const  text = `  
قبل از آموزش ری اکت ReactJS ابتدای کار به شما بگیم که تکنولوژی ری اکت  
برگ برنده برنامه نویسان در دنیای امروز هست اصلا اغراق نکردیم. یه غول  
به تمام معنا و دنیایی بی انتها از پروژه هایی که میشه با اون نوشت، اون  
هم خیلی سریع و راحت! تکنولوژی که دنیای وب رو دگرگون کرد و دستپخت شرکت  
فیسبوک هست که اینستاگرام رو هم با اون طراحی کرده!  

کامپوننت محور بودن ری اکت باعث میشه شما با کدنویسی یک بخش بتونید بی  
نهایت بار در بخش های مختلف پروژه از اون استفاده کنید و از طرفی میتونید  
پروژه هایی بسازید که بدون نیاز به رفرش، هر دیتا و بخشی از صفحه رو  
تغییر بدید اون هم با سرعت نور! برای همین ری اکت، زمان کدنویسی و به  
اتمام پروژه رو خیلی کوتاهتر از قبل کرده! خلاصه به شما تبریک میگیم که  
خیلی دقیق مطالعه کردید و به این نتیجه رسیدید که الان بهترین زمان برای  
یادگیری ری اکت هست. پس از الان با تمام اطمینان خیالتون رو راحت می کنیم  
: شما با دوره آموزش ری اکت سبزلرن، نه تنها به این تکنولوژی به تسلط 100  
درصد می رسید، بلکه طوری آموزش عملی می بینید و راهنمایی می گیرید که یک  
راست وارد بازار کار بشید. بی حرف و حدیث. بی ترس و تردید!   

اگه به حوزه برنامه نویسی سمت کاربر، طراحی رابط کاربری (UI) و به طور کلی   
پروژه های تعامل محور و سریع علاقه دارید، ری اکت یکی از بهترین دستیاران شما برای  
رسیدن به این هدف خواهد بود و لذت برنامه نویسی و پیاده سازی ایده هاتون  
رو چندین برابر میکنه. وقتی شرکت‌ های معتبری مثل فیسبوک (Facebook)و  
شرکت بزرگ پرداخت بین المللی یعنی پی پال (PayPal) و همینطور بزرگترین  
VOD جهان یعنی نتفلیکس، از ری اکت برای طراحی وب سایت و اپلیکیشن خودشون  
استفاده کردن، پس خیالتون راحت باشه با یک تکنولوژی تمام عیار سروکار  
دارید که می‌تونید برای انجام هر پروژه ای روی اون حساب کنید و در بازار  
کار حرفی برای گفتن داشته باشید. در ایران هم دیوار و اسنپ بزرگترین  
پلتفرم‌هایی هستن که با ری اکت توسعه داده شدن! در ادامه به تمام سوالات  
و دغدغه هایی که ممکنه قبل از شروع دوره در ذهن شما باشه جواب دادیم تا  
با خیال راحت و دید باز مسیر آموزشتون رو شروع کنید. تو این دوره قراره  
چی یاد بگیریم؟ خلاصه ای از موارد مهم در جاوا اسکریپت به عنوان پیش نیاز  
دوره ری اکت نحوه استفاده از پکیج هایی مانند react bootstrap و mui و  
react-icons نحوه کار با api ، متدهای lifecycle و انواع هوک ها آموزش  
پکیج react router به همراه کدنویسی یک پروژه داشبورد ادمین به صورت spa  
و با استفاده از دیتابیس فایربیس آموزش کانسپت های مهمی مانند Context  
API ، Hoc ، memo ، custom hook و … تمرین پروژه هایی مثل رستوران و  
pagination و cms فارسی که از بک اند اختصاصی Node js استفاده میکنن و  
همه اونها به صورت spa هستن. پیاده سازی عملی پروژه ی سبزلرن به صورت  
کامل+۳ نوع cms و بک اند اختصاصی Nodejs آموزش فوت و فن رزومه نویسی به  
همراه آنالیز رزومه های متفاوت برای افزایش شانس جذب در بازار کار این  
دوره برای چه کسانی مناسب هست؟ دوره جامع ری اکت برای دو دسته از  
دانشجوها خیلی مفید و کاربردی هست. دسته اول کسانی که آموزش جاوا اسکریپت  
رو تموم کردن و دنبال یک تکنولوژی مدرن و پولساز بر پایه جاوا ما با سیاست خاصی که در انتخاب استاد، تدوین محتوای آموزشی، قیمت گذاری دوره ها و پشتیبانی موثر در نظر گرفتیم میتونیم این تضمین رو به شما بدیم که در طول دوره آموزش، هیچ کمبودی در هیچ زمینه ای احساس نکنید.

1 – پشتیبانی رایگان و مادام‌العمر
دوره جامع ری‌اکت سبزلرن پشتیبانی رایگان و مادام‌العمر داره. یعنی شما حتی بعد از استخدام می‌تونین سوالات و ابهاماتی که دارین رو توسط پشتیبانی دوره برطرف کنین.

2 – پروژه محور بودن دوره
در دوره جامع ری‌اکت سبزلرن علاوه بر چندین مینی پروژه، خود وب‌سایت سبزلرن به عنوان پروژه نهایی دوره همراه با 3 پنل مدیریت به صورت فول‌استک با بک‌اند آماده و اختصاصی Nodejs پیاده سازی شده. جالبه بدونید پروژه نهایی دوره دقیقا طبق اصول جاری در شرکت های واقعی توسعه داده شده تا بتونید با چالش های واقعی بازار کار آشنا شده و بعد از گذرونده دوره با آمادگی بالا وارد بازار کار بشید.

3 – منتورشیپ بودن دوره
شتیبانی دوره در گروه تلگرامی انجام میشه و علاوه بر مدرس، چند نفر کمک پشتیبان مسلط جهت پاسخگویی و رفع مشکلات شما نیز حضور دارند. بنابراین برای رفع مشکلات و جواب سوالات درگیر تیکت و انتظار نمیشید و در سریع ترین زمان ممکن کارتون راه میفته!

صدها برنامه نویس فوق حرفه ای ری اکت که در دانشگاه سبزلرن پرورش پیدا کردن الان تو شرکت های بزرگ مشغول هستن و نتیجه انتخاب درست منبع آموزشی و تمرینات منظم خودشون رو گرفتن. پس قطعا شما هم میتونید ردپای اونهارو دنبال کنید و به آرزوتون برسید.

بعد از اتمام دوره به چه نتیجه ای می رسیم؟
بعد از سال ها تجربه و پرورش صدها برنامه نویس می تونیم به جرات اعلام کنیم که کامل ترین و بهترین دوره آموزش ری اکت در اختیار شماست و غیر از اون به هیچ منبع و استاد دیگه ای نیاز نخواهید داشت. با بهترین کیفیت، بهترین مدرس و بهترین پشتیبانی!

دوره ای که صدها دانشجو داشته و میزان رضایت اون هارو میتونید در قسمت کامنت های صفحه محصول ببینید. باعث افتخار هست که تونستیم تا این حد نظرات مثبت دانشجویان با شرایط تخصصی و سنی مختلف رو به دست بیاریم.

یقین بدونید که بلافاصله بعد از دوره به چنان تسلط و آگاهی در تکنولوژی ری اکت می رسید که بتونید در هر زمینه ای به راحتی کار کنید و پروژه های بزرگی در زمینه وب سایت و اپلیکیشن بسازید. طبیعیه اول کار ذهنتون مقاومت کنه چون تا الان سبز لرنی آموزش ندیدید اما بعد از پایان آموزش خودتون این حس رو پیدا خواهید کرد. البته با کمک و همراهی خودتون!

این دوره پیش نیاز خاصی داره که باید قبلش بلد باشم؟
یکی از کاربردهای اصلی ری اکت در برنامه نویسی وب هست و میدونید که هرجا صحبت از وب باشه، HTML و CSS هم مثل جاکلیدی به اون وصل میشن. در کنار این دو، زبان جاوا اسکریپت رو به عنوان اصلی ترین زبان محیط وب هم باید خوب یاد بگیرید چون زبان مادر محیط ری اکت هست و به نوعی الفبای اون محسوب میشه.  برای همین قبل از آموزش ری اکت باید به این سه مورد آشنا باشید یا بهتره بگیم مسلط باشید. در غیر این صورت وسط آموزش ری اکت دچار سردرگمی میشید و نمی تونید ارتباط خوبی برقرار کنید.

اگه از دانشجوهای قدیمی باشید که میدونید اما اگه جدیدا افتخار میزبانی از شمارو پیدا کردیم، بدونید که هم HTML و هم CSS و هم جاوا اسکریپت در سبزلرن دوره رایگان دارن و در واقع مهمون ما هستید برای شروع یک مسیر هیجان انگیز در زندگی حرفه ای خودتون. این هم از دغدغه پیش نیازها!

چطور میتونم پروژه دانشجویان قبلیتون رو ببینم ؟
مدرس هر دوره معمولا صفحه خودش رو در شبکه اجتماعی با شما به اشتراک میگذاره. شما میتونید با دنبال کردن اون با کلی دانشجو و پروژه ای که توسط اونها انجام شده آشنا بشید تا ادعای سبزلرن در مورد کیفیت آموزش ها از جمله آموزش ری اکت به شما اثبات بشه.

کسانی که مثل خودتون روز اولی داشتن و کلی تردید و نگرانی تو ذهنشون بود اما الان و با ادامه مسیر یادگیریشون در بقیه حوزه ها، به برنامه نویس های حرفه ای تبدیل شدن که هر شرکتی آرزوی همکاری با اون‌هارو داره . چون از دانشگاه شریف برنامه نویسی یعنی سبزلرن فارغ التحصیل شدن

با یادگیری ری اکت میتونم به درآمد برسم؟
این سوال رو خیلی از دوستان می پرسن ما هم یک بار برای همیشه به اون جواب میدیم. یادگیری زبان های برنامه‌نویسی مثل هر علم دیگه ای نیاز به تلاش و تمرین و استمرار داره. ممکنه شما دانشجو باشید یا کارمند یا یک فارغ‌التحصیل سربازی رفته با تایم آزاد! هرکدوم از این حالت ها میتونه در میزان زمان و انرژی که برای یادگیری صرف می کنید موثر باشه. و هرچقدر هم زودتر و بهتر یاد بگیرید طبیعتا فاصله شما تا رسیدن به درآمد هم کوتاه‌تر خواهد بود.

اما به طور کلی اگر خوب یاد بگیرید و خوب تمرین کنید، ما این موضوع رو تضمین میکنیم که بعد از دوره بتونید پروژه های شگفت انگیزی بسازید که قبل از شروع دوره اصلا فکرشو نمیکردید تا این حد پیشرفت می کنید.

وقتی این دوره رو دیدم قدم بعدیم چیه؟
وقتی یک دوره کامل رو می گذرونید، دیگه وقت تمرین کردن و پروژه ساختن هست. حتی میتونید پروژه هایی که تو ذهنتون هست یا دیگران ساختن رو بنویسید تا کاملا مطمئن بشید به حد کافی از تسلط رسیدید و یه رزومه قابل قبول تدوین کنید. بلافاصله بعد از این روزها می تونید با اعتماد به نفس کامل وارد بازار کار بشید و از این آموزش ها پول بسازید.

بعد از اتمام دوره میتونم یه پروژه کامل بنویسم؟
هدف نهایی کدنویسی، ساخت پروژه هست و اگر قرار باشه فقط ساختار و کد یاد بگیرید اما در عمل چیزی خلق نکنید که فقط زمان هدر رفته! اساتید سبزلرن به خاطر حضور پر رنگ در بازار کار و درگیر بودن با پروژه های بزرگ، کاملا دیدگاه عملی دارن و تمام نکات آموزش ری اکت رو در قالب مثال و پروژه تمرینی به شما میگن.

شما هم بعد از یادگیری و تسلط، به راحتی میتونید یک پروژه صفر تا صد بنویسید حتی اون رو به یک بک اند واقعی متصل کنید.

نمونه پروژه هایی که در طی این دوره به صورت عملی کار می کنید :

پیاده سازی مینی پروژه با حال Nav bar
پیاده سازی مینی پروژه جذابLanding page
پیاده سازی پروژه فروش بلیط انلاین
پیاده سازی پروژه ToDo list & Note App
پیاده سازی داشبورد ادمین rtl  باک اند اختصاصی Node js
پیاده سازی سایت سبزلرن با بک اند اختصاصی Node js
این تخصص از لحاظ درآمدی چطوره ؟
وقتی یک زبان برنامه نویسی روند توسعه خیلی خوبی می گیره، به دنبالش کاربرد و رواج اون هم در کشورها بیشتر میشه. بعدش چه اتفاقی میفته؟! تقاضای متخصص اون زبان در بازار زیاد میشه. بعدش ؟

چون میزان تقاضا نسبت به افراد متخصص این حوزه خیلی بیشتر هست، پس حقوق ها هم در سطح بالایی تعیین میشه. به عنوان مثال برنامه نویس React که یک پلتفرم جاوا اسکریپتی هست بسته به بزرگی شهر محل سکونت یا پروژه بین 30 تا 60 میلیون تومن ماهانه دریافت می کنه که 4 تا 8 برابر یک حقوق عادی اداره کار محسوب میشه.

پس بدونید که آینده این شغل از لحاظ درآمدی هم فوق العادست به شرطی که به مهارت بالایی برسید.

چه تضمینی هست که خوب و کامل یاد بگیرم؟
چندین دلیل هست که معمولا باعث نتیجه گیری شما از دوره آموزش ری اکت میشه :

1 – کیفیت محتوای آموزشی و مدرس اون

2 – اشتیاق و علاقه مندی کافی برای یادگیری

3 – پشتیبانی در دسترس و قوی در حین آموزش

4 – مرور و تمرین مطالب و انبار کردن اونها برای روز مبادا !

5 – تسلط نسبی به زبان انگلیسی، جاوا اسکریپت و CSS

6 – مطالعه منظم و کامل مستندات رسمی ری اکت (داکیومنت)

چهار مورد اینها بر عهده شماست و دو مورد هم بر عهده سبزلرن. ما به شما قول میدیم این آموزش رو با بالاترین کیفیت و موثرترین پشتیبانی در اختیار شما قرار بدیم. شما قول میدید که با علاقه و پشتکار تمام تمرینات رو انجام بدید تا به نتیجه برسید؟! پس همه چی حله…`


;
export default text